app/views/books/_book.html.erb

			<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
			<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

			<i class="fa fa-heart-o" aria-hidden="true"></i>
			<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]