app/controllers/favorites_controller.rb

	def create
		@book = Book.find(params[:book_id])
		favorite = @book.favorites.new(user_id: current_user.id)
		favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["book_id", 3], ["created_at", "2020-04-19 08:52:57.929204"], ["updated_at", "2020-04-19 08:52:57.929204"]]